In [102]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import warnings

warnings.filterwarnings("ignore")

In [103]:
np.nan

nan

In [104]:
name = ["jhon", "jack", "jill", "kenny", "kevin"]
math = [89, 78,67 ,np.nan, 85]
science = [78, 75, np.nan, np.nan, 76]

In [105]:
dic = {"name": name, "math": math, "science": science}

In [106]:
df = pd.DataFrame(dic)

In [107]:
df
df_1 =df.copy()
df_2 =df.copy()
df_3 =df.copy()

In [108]:
# dop null values
df_1.isnull().sum()
# df.dropna()

name       0
math       1
science    2
dtype: int64

In [109]:
# drop rows that contains null values
df_1.dropna()

    name  math  science
0   jhon  89.0     78.0
1   jack  78.0     75.0
4  kevin  85.0     76.0

In [110]:
# drop columns with null values
df_1.dropna(axis=1, inplace=True)

In [111]:
df_1

    name
0   jhon
1   jack
2   jill
3  kenny
4  kevin

In [112]:
df_2

    name  math  science
0   jhon  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      NaN
3  kenny   NaN      NaN
4  kevin  85.0     76.0

In [113]:
df_2.drop(2)

    name  math  science
0   jhon  89.0     78.0
1   jack  78.0     75.0
3  kenny   NaN      NaN
4  kevin  85.0     76.0

In [114]:
df_2.drop([2,3])

    name  math  science
0   jhon  89.0     78.0
1   jack  78.0     75.0
4  kevin  85.0     76.0

In [115]:
# drop columns
df_2.drop("math", axis=1)

    name  science
0   jhon     78.0
1   jack     75.0
2   jill      NaN
3  kenny      NaN
4  kevin     76.0

In [117]:
## fill null values

df.fillna(0)

    name  math  science
0   jhon  89.0     78.0
1   jack  78.0     75.0
2   jill  67.0      0.0
3  kenny   0.0      0.0
4  kevin  85.0     76.0

In [118]:
math_mean = df["math"].mean()
science_mean = df["science"].mean()

In [121]:
df["math"].fillna(math_mean, inplace=True)
df["science"].fillna(science_mean, inplace=True)

In [122]:
df

    name   math    science
0   jhon  89.00  78.000000
1   jack  78.00  75.000000
2   jill  67.00  76.333333
3  kenny  79.75  76.333333
4  kevin  85.00  76.000000